status = "hard"

# Карта:

now_map = [0, ['#', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `'], ['#', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `'], ['#', '  `', '  `', '  `', '  `', '  `', ' E4', '  `', '  `', '  `', '  `', '  `', '  `'], ['#', '  `', '  `', '  `', '  `', '  `', ' B2', '  `', ' E5', ' E6', '  `', '  `', '  `'], ['#', '  `', '  `', '  `', '  `', ' B1', '  `', '  `', ' L1', '  `', '  `', '  `', '  `'], ['#', '  `', '  `', '  `', ' E1', '  `', '  `', ' B3', '  `', '  `', '  `', '  `', '  `'], ['#', '  `', '  `', '  `', '  `', '  `', '  `', ' E2', ' E3', '  P', '  `', '  `', '  `'], ['#', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `'], ['#', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `', '  `']]

# Артефакты:

player_artefacts = {'sharpening_stone_1': 2, 'sharpening_stone_2': 2, 'hard_skin_potion_1': 1, 'hard_skin_potion_2': 1, 'turkey_plumage_1': 1, 'turkey_plumage_2': 1}

# Характеристики игрока:

player_creature = [93, 15, 10, 1, 3, 3, 15, 100]

# Характеристики врагов:

enemies_dict = {"Enemy_1": {"Elsa 1": [200, 1, 2, 1, 1, 1, 1, 200]}, "Enemy_2": {"Baron 1": [11, 1, 1, 1, 1, 1, 1, 10]}, "Enemy_3": {"Elsa 2": [186, 1, 2, 1, 1, 1, 1, 200]}, "Enemy_4": {"Elsa 3": [200, 1, 2, 1, 1, 1, 1, 200]}, "Enemy_5": {"Elsa 4": [200, 1, 2, 1, 1, 1, 1, 200]}, "Enemy_6": {"Baron 2": [11, 1, 1, 1, 1, 1, 1, 10]}, "Enemy_7": {"Elsa 5": [200, 1, 2, 1, 1, 1, 1, 200]}, "Enemy_8": {"Baron 3": [11, 1, 1, 1, 1, 1, 1, 10]}, "Enemy_9": {"Elsa 6": [200, 1, 2, 1, 1, 1, 1, 200]}, "Enemy_10": {"Lucius 1": [100, 10, 0, 2, 0, 2, 20, 100]}}

# Статистика:

easy_passed = 0
medium_passed = 0
hard_passed = 0
get_artifacts = 0
enemies_killed = 0
damage_received = 0
damage_done = 0
health_regenerated = 0
cells_passed = 0
